# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 2  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors: 3  # AutoAnchor evolves 3 anchors per P output layer

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [ [ -1, 1, Conv, [ 64, 6, 2, 2 ] ],  # 0-P1/2
    [ -1, 1, Conv, [ 128, 3, 2 ] ],    # 1-P2/4
    [ -1, 3, C3, [ 128 ] ],           # 2
    [-1, 1, CBAM, [ 128 ] ],           # +3
    [ -1, 1, Conv, [ 256, 3, 2 ] ],    # 4-P3/8
    [ -1, 6, C3, [ 256 ] ],           # 5=====
    [-1, 1, CBAM, [ 256 ] ],           # +6=
    [ -1, 1, Conv, [ 512, 3, 2 ] ],    # 7-P4/16
    [ -1, 9, C3, [ 512 ] ],           # 8======
    [-1, 1, CBAM, [ 512 ] ],           # +9=
    [ -1, 1, SPPF, [ 512, 5 ] ],       # 10
  ]

# YOLOv5 v6.0 head with (P3, P4) outputs
head:
  [ [ -1, 1, Conv, [ 256, 1, 1 ] ],   # 11======
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ [ -1, 6 ], 1, Concat, [ 1 ] ],  # cat backbone P3
    [ -1, 3, C3, [ 256, False ] ],  # 11-->14 (P3/8-small)

    [ -1, 1, Conv, [ 256, 3, 2 ] ],
    [ [ -1, 11, 9 ], 1, Concat, [ 1 ] ],  # cat head P4
    [ -1, 3, C3, [ 512, False ] ],  # 14-->17 (P4/16-medium)

    [ [ 14, 17 ], 1, Decoupled_Detect, [ nc, anchors ] ],  # Detect(P3, P4)
  ]
